app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def all_events
    @events = Event.all

INSERT INTO "events" ("name", "location", "date_time", "description", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @event = current_user.events.create!(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @event = Event.find_by(id: params[:id])

UPDATE "events" SET "name" = $1, "location" = $2, "description" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["name", "Best Sporting Town Ever"], ["location", "Kent"], ["description", "Going to play sports all day"], ["updated_at", "2019-10-17 06:41:42.407750"], ["id", 3]]
---
  def update
    @event.update(event_params)

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_event
    @event = current_user.events.find(params[:id])