app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("ticket_class", "description", "availability", "price", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
      @ticket = @event.tickets.create!(ticket_params)

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @ticket = Ticket.find_by(id: params[:id])

UPDATE "tickets" SET "price" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["price", 20], ["updated_at", "2019-10-16 20:45:28.113930"], ["id", 1]]
---
    def update
      @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 5]]
---
    def destroy
      @ticket.destroy

SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_event
      @event = current_user.events.find(params[:event_id])